{
     "startCommand" : [
        "Hello! I am a tipping Bot 📊 for Trust Wallet users!"
    ],

  "debugCommandMessages" : [
    "",
    "",
    "🛑 %username%, You don't have permission to run this command.\nIt's for Admin.",
    "",
    "",
    "",
    " works only in public chats",
    "Use this command in chat with ",
    "Your Active token = ",
    "Not enough BNB to perform Transaction",
    "You have not enough ",
    "Your wallet is Empty - please deposit tokens",
    "You can not claim. First register your wallet in ",
    "Can't do transactions - have no full access to your wallet",
    "Talk to ",
    " and set the Private Key in ⚙️ Settings menu",
    "Unknown token"
  ],

  "privateDialogMessages" : [
    "Please enter the value of coins You want to use in TIP and GIVEAWAY commands by Default:",
    "Wrong value. Please, enter another:",
    " will be used in TIP and GIVEAWAY commands",
    "You already have funds in staking contract. You will lose your staking reward if you make a new deposit into the contract. You should withdraw your staking reward first or use a another account for a new staking deposit",
    "Your funds will be locked for 27 days and you will be unable to withdraw within the locking period\nYou need to pay transaction fees to start staking, withdraw your stake, or claim staking rewards! Make sure that you have enough funds left on your balance to perform these transactions.\nStaking rewards are very unpredictable and the amount of reward depends on the time when you are claiming it",
    "Staking round is in progress. Please wait",
    "Not staking yet",
    "WARNING: Remember to write down your private key somewhere safe, in the event of something happening with telegram or the tip bot you will be able to handle your wallet with <a href=\"http://myetherwallet.com/\">MEW</a>",
    "Enter Your twitter @UserName.",
    "Linked twitter account: ",
    "You can link another account. Just enter another twitter @UserName",
    "This account will be used to check retweets of community posts - so You can receive Rains.",
    "Successfully linked Your twitter account !",
    "account not Found on twitter! Try another.",
    "💰Earn money for free 💰\n\nJoin to Callisto Network telegram group (@CallistoNet) and follow the opportunities to earn 🍀",
    "You will claim reward from the cold staking contract: <code>0xd813419749b3c2cDc94A2F9Cfcf154113264a9d6</code>",
    "Minimum balance in your address to claim this reward: <code>0.1",
    "❗️Warning: After claiming the reward, your funds will be frozen for the next 27 days and you will be unable to claim new reward OR withdraw your funds during this period.",
    "❗️Warning: Claiming your reward do not give you back your initial investment and it will re stake automatically your founds. To withdraw all, press <code>withdraw</code>",
    "You will withdraw your stake from the cold staking contract: <code>0xd813419749b3c2cDc94A2F9Cfcf154113264a9d6</code>",
    "❗️Warning: After withdrawing, your will get back all your initial investment and receive all staking reward. Current staking round will be cancelled.",
    "Admin functions enabled",
    "Welcome to Trust Wallet tip bot. Use /help command to get additional Info. Note: bot works with Trust Wallet address. Please, DO NOT use address form other wallets, especially Exchanges",
    "Enter your Trust Wallet address.\n",
    "This address will be used to receive Tokens.\nPlease do not use Exchange wallet address",
    "Your current BNB/TWT wallet address in Trust:\n",
    "You can change address.\nJust send me another BNB or TWT wallet address in Trust\nPlease do not use Exchange wallet address",
    "Successfully set wallet address !",
    "Send me your seed-phrase to enable Transactions from your BNB/TWT Wallet",
    "Your have set full access for address:\n",
    "You can change wallet. Just send me new seed-phrase",
    "Successfully set FULL access to Wallet !",
    "Wrong BNB address. Try another",
    "Can not recover Wallet from your seed-phrase",
    "Please enter the Token you want to use by Default:",
    "Selected token for use in operations = ",
    "To switch token - click appropriate button",
    " will be used in RAIN commands",
    "Provided address is likely an Exchange one - bot can not work with such type of address"
  ],

  "twitterMessages" : [
    "Tweet monitoring already finished",
    "Retweets counter: ",
    "No retweeters found :(",
    "This Twitter account as already Linked. New link is not possible"
    ],

    "mainKeyboard" : [
        "👛 Register Wallet",
        "ℹ Help",
        "💰 Balance",
      "⬅️ Main Menu",
      "⚙️ Settings",
      "ℹ  Main Menu",
      "Earn coins 💵"
    ],

  "settingsKeyboard" : [
    "Default Tip value",
    "Language",
    "🔑 Set PrivateKey",
    "🕊 Twitter Name",
    "📝 Operations history",
    "🔁 Switch coin/token",
    "🛠 Default values"
  ],

  "stakingKeyboard" : [
    "🔋 Status",
    "📥 Start Staking",
    "💵 Claim Reward",
    "♻️ Withdraw"
  ],

    "helpCommand" : [
        "ℹ <b>Help</b>",
        "",
        "Tipping bot for <a href=\"https://trustwallet.com\">Trust Wallet</a> and all Binance Chain tokens",
      "",
      "/start — Start dialog with Bot",
      "/help — This help menu",
      "",
      "<b>Commands for common chats (<code>only for chat Admins</code>): </b>",
      "<b>NOTE:</b> before using this commands - first link your wallet to Bot through the private chat and select Token for use with commands",
      "/token - show Token, which will be used in all commands",
      "( <code>it's a good practice to check selected Token before calling other commands</code> )",
      "( you can use / token command in group chat to instantly change your default token: <code>/token TWT</code> - to set TWT )",
      "/zzstat - show some common statistics",
      "( Usage: <code>/zzstat</code> or <code>/zzstat TWT</code> - stat for TWT token )",
      "( or <code>/zzstat BNB</code> - stat for BNB token )",
      "/zztip - tip user",
      "( Usage: <code>/zztip @toUserName value</code> )",
      "( Usage in \"Reply\" message: <code>/zztip value</code> )",
      "/zzgiveaway - Giveaway coins in a group to first who claim",
      "( Usage: <code>/zzgiveaway value</code> )",
      "( every user can Claim once in <code>24h</code> )",
      "/zzgiveauto - Auto create Giveaway with time interval (in Hours)",
      "( Usage: <code>/zzgiveauto each-time-value interval</code>)",
      "( giveauto will be stopped if not enough coins )",
      "/zzgivestop - command to STOP /zzgiveauto",
      "/zzrain - spread some N coins among X users",
      "( Usage: <code>/zzrain value NUMBER_of_Users</code> )",
      "( instead of NUMBER_of_Users may use <code>ALL</code> or <code>MAX</code> replacement - to use all available users of current chat )",
      "( if <code>value</code> param is omitted - <b>default</b> Rain value will be used )",
      "( function can take a long time ) ",
      "/zztweet or /zztwit - start monitoring of retweets",
      "( Usage: <code>/zztweet value tweet_URL</code> - monitor tweet_URL with target retweets count set to VALUE )",
      "( <b>value</b> is not mandatory. So <code>/zztweet tweet_URL</code> - will also work )",
      "( if tweet is already monitored - current retweets count will be shown )",
      "( tweet ID (number) can be used instead of full URL )",
      "/zzrtrain - similar to RAIN but with retweets check",
      "( Usage: <code>/zzrtrain value tweet_URL</code> )",
      "( only those users, who linked their tip bot's account with Twitter and retweeted the Tweet will receive Rain )",
      "( if <code>value</code> param is omitted - <b>default</b> Rain value will be used )",
      "",
      "tip author: <code>bnb1ddj9wx2hpvndk8tttr63wy06d2hzjs5qavdpac</code>"
    ],

    "helpCommandAdmin" : [
      "",
      "/message - send message from bot to user (param1 - ID user, param2 - text)",
      "/chatlist - list known chats ID",
      "/config - view current config",
      "/msgallchats - Send message to All chats",
      "/msgallusers -  Send message to All users",
      "/botrestart - restart the bot process",
      "/botstop - stop the bot process"
    ]
}
